Ques 1

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

Here are five commonly used functions in the pandas library along with their execution:

1. read_csv() :This function is used to read data from a CSV file and create a DataFrame.

In [3]:
df=pd.read_csv( "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

2. head(): This function is used to display the first few rows of a DataFrame.

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

3. describe(): This function provides descriptive statistics of the DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartiles.

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

4. groupby(): This function is used to group data based on one or more columns and perform aggregations on the grouped data.

In [6]:
grouped_data=df.groupby('Survived')

In [7]:
grouped_data.sum()

/tmp/ipykernel_5108/2092897760.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped_data.sum()

          PassengerId  Pclass       Age  SibSp  Parch        Fare
Survived
0              245412    1390  12985.50    304    181  12142.7199
1              151974     667   8219.67    162    159  16551.2294

5. merge() : function in pandas is used to combine two or more DataFrames based on a common column or index. It performs database-style join operations on the DataFrames.

In [8]:
df1 = pd.DataFrame({'ID': [1, 2, 3, 4],
                    'Name': ['Sumit', 'Amit', 'Nidhi', 'Alka']})

df2 = pd.DataFrame({'ID': [2, 3, 4, 5],
                    'Age': [25, 30, 27, 35]})

In [9]:
pd.merge(df1,df2)

   ID   Name  Age
0   2   Amit   25
1   3  Nidhi   30
2   4   Alka   27

Ques 2

In [10]:
def reindex(df):
    new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    df.index = new_index
    return df

In [11]:
df_ori = pd.DataFrame({'A': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
                   'B': [2, 4, 6, 8, 10, 12, 14, 16, 18, 20],
                   'C': [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
                  })

In [12]:
 reindex(df_ori)

     A   B   C
1    1   2   3
3    2   4   6
5    3   6   9
7    4   8  12
9    5  10  15
11   6  12  18
13   7  14  21
15   8  16  24
17   9  18  27
19  10  20  30

Ques 3

In [13]:
def cal_sum(df):
    values_col=df['Values']
    Sum_values=values_col[:3].sum()
    return Sum_values

In [14]:
data=pd.DataFrame({'Values': [10,20,30,40,50]})

In [15]:
cal_sum(data)

60

Ques 4

In [16]:
df=pd.DataFrame({'Text':['Reading data from GitHub', 'ensure you read from the raw URL.',' For example', 'in the above', 'if you try loading the data directly from',' https://github.com/datasciencedojo/datasets/blob/master/titanic.csv',' the download process will fail.',' When you land in such a URL',' open raw content using the “Raw” button at the top of the DataFrame then you will have the correct URL like the one we used in the above example.']})

In [17]:
df['Word_Count']=df['Text'].apply(len)

In [18]:
df

                                                Text  Word_Count
0                           Reading data from GitHub          24
1                  ensure you read from the raw URL.          33
2                                        For example          12
3                                       in the above          12
4          if you try loading the data directly from          41
5   https://github.com/datasciencedojo/datasets/b...          68
6                    the download process will fail.          32
7                        When you land in such a URL          28
8   open raw content using the “Raw” button at th...         146

Ques 5

DataFrame.size: It returns the total number of elements in the DataFrame. It is calculated as the product of the number of rows and columns in the DataFrame. In other words, it represents the total number of cells or entries in the DataFrame.

DataFrame.shape: It returns a tuple representing the dimensions of the DataFrame, i.e., the number of rows and columns. The shape attribute is commonly used to check the dimensions of the DataFrame and is often used to access the number of rows or columns individually using indexing .

In [19]:
datas=pd.DataFrame({'A': [1, 2, 3,4,5,6], 'B': [4, 5, 6,7,8,9]})

In [20]:
datas.size

12

In [21]:
datas.shape

(6, 2)

Ques 6

The function used to read an Excel file in pandas is pd.read_excel(). This function allows you to read data from an Excel file and create a DataFrame in pandas.

df = pd.read_excel('path/to/file.xlsx',sheet_name='Sheet1')

Ques 7

In [22]:
def extract_username(email):
    return email.split('@')[0]
def user_name(df):
    df['Username']=df['Email'].apply(extract_username)
    return df

In [23]:
df=pd.DataFrame({'Email':['Sumit.Kumar@gmail.com','Amit.Kumar@gmail.com','Nidhi.Kumari@gamil.com']})

In [24]:
user_name(df)

                    Email      Username
0   Sumit.Kumar@gmail.com   Sumit.Kumar
1    Amit.Kumar@gmail.com    Amit.Kumar
2  Nidhi.Kumari@gamil.com  Nidhi.Kumari

Ques 8

In [58]:
def select_rows(df):
    selected_rows=df.loc[(df['A']>5) & (df['B']<10)]
    return selected_rows

In [59]:
df=pd.DataFrame({'A':[3,8,6,2,9],
                 'B':[5,2,9,3,1],
                 'C':[1,7,4,5,2]})
selected_df=select_rows(df)

In [60]:
selected_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Ques 9

In [75]:
df_val=pd.DataFrame({'Values':[1,2,4,4,5,6,7,8,9]})
mean_value = df_val['Values'].mean()
median_value = df_val['Values'].median()
std_value = df_val['Values'].std()


print("Mean:", mean_value)
print("Median:", median_value)
print("Standard Deviation:", std_value)

Mean: 5.111111111111111
Median: 5.0
Standard Deviation: 2.6666666666666665

Ques 10

In [85]:
import datetime

data = {'Date': [(datetime.datetime.now().date() + datetime.timedelta(days=i)).strftime('%Y-%m-%d') for i in range(15)],
        'Sales': [10, 15, 8, 12, 20, 18, 16, 11, 9, 14, 13, 17, 22, 19, 21]}

In [86]:
data

{'Date': ['2023-07-06',
  '2023-07-07',
  '2023-07-08',
  '2023-07-09',
  '2023-07-10',
  '2023-07-11',
  '2023-07-12',
  '2023-07-13',
  '2023-07-14',
  '2023-07-15',
  '2023-07-16',
  '2023-07-17',
  '2023-07-18',
  '2023-07-19',
  '2023-07-20'],
 'Sales': [10, 15, 8, 12, 20, 18, 16, 11, 9, 14, 13, 17, 22, 19, 21]}

In [87]:
def moving_avg(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df.sort_values(by='Date', inplace=True)
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [90]:
data_avg=pd.DataFrame(data)
moving_avg(data_avg)

         Date  Sales  MovingAverage
0  2023-07-06     10      10.000000
1  2023-07-07     15      12.500000
2  2023-07-08      8      11.000000
3  2023-07-09     12      11.250000
4  2023-07-10     20      13.000000
5  2023-07-11     18      13.833333
6  2023-07-12     16      14.142857
7  2023-07-13     11      14.285714
8  2023-07-14      9      13.428571
9  2023-07-15     14      14.285714
10 2023-07-16     13      14.428571
11 2023-07-17     17      14.000000
12 2023-07-18     22      14.571429
13 2023-07-19     19      15.000000
14 2023-07-20     21      16.428571

Ques 11

In [92]:
df_weekday=pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})

In [97]:
def weekday(df):
    df['Weekday']=pd.to_datetime(df['Date']).dt.day_name()
    return df

In [99]:
weekday(df_weekday)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Ques 12

In [110]:
data = {'Date': ['2023-01-02', '2023-01-15', '2023-01-25', '2023-02-05', '2023-03-10'],
        'Value': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

In [111]:
def rows_date(df):
    df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime if not already
    start_date = pd.to_datetime('2023-01-01')
    end_date = pd.to_datetime('2023-01-31')
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    return selected_rows

In [112]:
rows_date(df)

        Date  Value
0 2023-01-02     10
1 2023-01-15     20
2 2023-01-25     30

Ques 13

The first and foremost library that needs to be imported to use the basic functions of pandas is the pandas library itself. It is the primary library for data manipulation and analysis in Python. To import pandas, you can use the following import statement:

In [113]:
import pandas as pd